openthread/openthread/third_party/ti/devices/cc26x2/driverlib/sha2.h
}

//*****************************************************************************
//
//! \brief Read the intermediate or final digest.
//!
//! \param [in] digestLength Length of the digest in bytes. Must be one of:
//! - ref SHA2_SHA224_DIGEST_LENGTH_BYTES
//! - ref SHA2_SHA256_DIGEST_LENGTH_BYTES
//! - ref SHA2_SHA384_DIGEST_LENGTH_BYTES
//! - ref SHA2_SHA512_DIGEST_LENGTH_BYTES
//!
//! \param [out] digest
//!        Pointer to an intermediate digest. Must be 32-bit aligned.
//!
//! \return REturns a status code.
//! - \ref SHA2_OLD_DIGEST_NOT_READ
//! - \ref SHA2_SUCCESS
//
//*****************************************************************************
__STATIC_INLINE uint32_t SHA2GetDigest(uint32_t *digest, uint8_t digestLength)
{
    // Check the arguments.
    ASSERT(!(intermediateDigest == NULL) && !(intermediateDigest & 0x03));
    ASSERT((digestLength == SHA2_SHA224_DIGEST_LENGTH_BYTES) ||
           (digestLength == SHA2_SHA256_DIGEST_LENGTH_BYTES) ||
           (digestLength == SHA2_SHA384_DIGEST_LENGTH_BYTES) ||
           (digestLength == SHA2_SHA512_DIGEST_LENGTH_BYTES));

    if (HWREG(CRYPTO_BASE + CRYPTO_O_HASHIOBUFCTRL) & CRYPTO_HASHIOBUFCTRL_OUTPUT_FULL_M) {
        return SHA2_OLD_DIGEST_NOT_READ;
    }
    else {
         // Read digest
        uint32_t i = 0;
        for (i = 0; i < (digestLength / sizeof(uint32_t)); i++) {
            digest[i] = HWREG(CRYPTO_BASE + CRYPTO_O_HASHDIGESTA + (i * sizeof(uint32_t)));
        }
        return SHA2_SUCCESS;
    }
}

//*****************************************************************************
//
//! \brief Confirm digest was read.
//
//*****************************************************************************
__STATIC_INLINE void SHA2ClearDigestAvailableFlag(void)
{
    HWREG(CRYPTO_BASE + CRYPTO_O_HASHIOBUFCTRL) = HWREG(CRYPTO_BASE + CRYPTO_O_HASHIOBUFCTRL);
}

//*****************************************************************************
//
//! \brief Enable individual crypto interrupt sources.
//!
//! This function enables the indicated crypto interrupt sources. Only the
//! sources that are enabled can be reflected to the processor interrupt.
//! Disabled sources have no effect on the processor.
//!
//! \param intFlags is the bitwise OR of the interrupt sources to be enabled.
//! - \ref SHA2_DMA_IN_DONE
//! - \ref SHA2_RESULT_RDY
//!
//! \return None
//
//*****************************************************************************
__STATIC_INLINE void SHA2IntEnable(uint32_t intFlags)
{
    // Check the arguments.
    ASSERT((intFlags & SHA2_DMA_IN_DONE) ||
           (intFlags & SHA2_RESULT_RDY));

    // Using level interrupt.
    HWREG(CRYPTO_BASE + CRYPTO_O_IRQTYPE) = CRYPTO_IRQTYPE_LEVEL_M;

    // Enable the specified interrupts.
    HWREG(CRYPTO_BASE + CRYPTO_O_IRQEN) |= intFlags;
}

//*****************************************************************************
//
//! \brief Disable individual crypto interrupt sources.
//!
//! This function disables the indicated crypto interrupt sources. Only the
//! sources that are enabled can be reflected to the processor interrupt.
//! Disabled sources have no effect on the processor.
//!
//! \param intFlags is the bitwise OR of the interrupt sources to be enabled.
//! - \ref SHA2_DMA_IN_DONE
//! - \ref SHA2_RESULT_RDY
//!
//! \return None
//
//*****************************************************************************
__STATIC_INLINE void SHA2IntDisable(uint32_t intFlags)
{
    // Check the arguments.
    ASSERT((intFlags & SHA2_DMA_IN_DONE) ||
           (intFlags & SHA2_RESULT_RDY));

    // Disable the specified interrupts.
    HWREG(CRYPTO_BASE + CRYPTO_O_IRQEN) &= ~intFlags;
}

//*****************************************************************************
//
//! \brief Get the current masked interrupt status.
//!
//! This function returns the masked interrupt status of the crypto module.
//!
//! \return Returns the status of the masked lines when enabled:
//! - \ref SHA2_DMA_IN_DONE
//! - \ref SHA2_RESULT_RDY
//
//*****************************************************************************
__STATIC_INLINE uint32_t SHA2IntStatusMasked(void)
{
    uint32_t mask;

    // Return the masked interrupt status
    mask = HWREG(CRYPTO_BASE + CRYPTO_O_IRQEN);
    return(mask & HWREG(CRYPTO_BASE + CRYPTO_O_IRQSTAT));
}

//*****************************************************************************
//
//! \brief Get the current raw interrupt status.
//!
//! This function returns the raw interrupt status of the crypto module.
//! It returns both the status of the lines routed to the NVIC as well as the
//! error flags.
//!
//! \return Returns the raw interrupt status:
//! - \ref SHA2_DMA_IN_DONE
//! - \ref SHA2_RESULT_RDY
//! - \ref SHA2_DMA_BUS_ERR
//
//*****************************************************************************
__STATIC_INLINE uint32_t SHA2IntStatusRaw(void)
{
    // Return either the raw interrupt status
    return(HWREG(CRYPTO_BASE + CRYPTO_O_IRQSTAT));
}

//*****************************************************************************
//
//! \brief Clear crypto interrupt sources.
//!
//! The specified crypto interrupt sources are cleared, so that they no longer
//! assert. This function must be called in the interrupt handler to keep the
//! interrupt from being recognized again immediately upon exit.
//!
//! \note Due to write buffers and synchronizers in the system it may take several
//! clock cycles from a register write clearing an event in the module until the
//! event is actually cleared in the NVIC of the system CPU. It is recommended to
//! clear the event source early in the interrupt service routine (ISR) to allow
//! the event clear to propagate to the NVIC before returning from the ISR.
//!
//! \param intFlags is a bit mask of the interrupt sources to be cleared.
//! - \ref SHA2_DMA_IN_DONE
//! - \ref SHA2_RESULT_RDY
//!
//! \return None
//
//*****************************************************************************
__STATIC_INLINE void SHA2IntClear(uint32_t intFlags)
{
    // Check the arguments.
    ASSERT((intFlags & SHA2_DMA_IN_DONE) ||
           (intFlags & SHA2_RESULT_RDY));

    // Clear the requested interrupt sources,
    HWREG(CRYPTO_BASE + CRYPTO_O_IRQCLR) = intFlags;
}

//*****************************************************************************
//
//! \brief Register an interrupt handler for a crypto interrupt.
//!
//! This function does the actual registering of the interrupt handler.  This
//! function enables the global interrupt in the interrupt controller; specific
//! crypto interrupts must be enabled via \ref SHA2IntEnable(). It is the interrupt
//! handler's responsibility to clear the interrupt source.
//!
//! \param handlerFxn is a pointer to the function to be called when the
//! crypto interrupt occurs.
//!
//! \return None
//!
//! \sa \ref IntRegister() for important information about registering interrupt
//! handlers.
//
//*****************************************************************************
__STATIC_INLINE void SHA2IntRegister(void (*handlerFxn)(void))
{
    // Register the interrupt handler.
    IntRegister(INT_CRYPTO_RESULT_AVAIL_IRQ, handlerFxn);

    // Enable the crypto interrupt.
    IntEnable(INT_CRYPTO_RESULT_AVAIL_IRQ);
}

//*****************************************************************************
//
//! \brief Unregister an interrupt handler for a crypto interrupt.
//!
//! This function does the actual unregistering of the interrupt handler. It
//! clears the handler called when a crypto interrupt occurs. This
//! function also masks off the interrupt in the interrupt controller so that
//! the interrupt handler no longer is called.
//!
//! \return None
//!
//! \sa \ref IntRegister() for important information about registering interrupt
//! handlers.
//
//*****************************************************************************
__STATIC_INLINE void SHA2IntUnregister(void)
{
    // Disable the interrupt.
    IntDisable(INT_CRYPTO_RESULT_AVAIL_IRQ);

    // Unregister the interrupt handler.
    IntUnregister(INT_CRYPTO_RESULT_AVAIL_IRQ);
}

//*****************************************************************************
//
// Support for DriverLib in ROM:
// Redirect to implementation in ROM when available.
//
//*****************************************************************************
#if !defined(DRIVERLIB_NOROM) && !defined(DOXYGEN)
    #include "../driverlib/rom.h"
    #ifdef ROM_SHA2StartDMAOperation
        #undef  SHA2StartDMAOperation
        #define SHA2StartDMAOperation           ROM_SHA2StartDMAOperation
    #endif
    #ifdef ROM_SHA2WaitForIRQFlags
        #undef  SHA2WaitForIRQFlags
        #define SHA2WaitForIRQFlags             ROM_SHA2WaitForIRQFlags
    #endif
    #ifdef ROM_SHA2GenerateInitialHash
        #undef  SHA2GenerateInitialHash
        #define SHA2GenerateInitialHash         ROM_SHA2GenerateInitialHash
    #endif
    #ifdef ROM_SHA2GenerateIntermediateHash
        #undef  SHA2GenerateIntermediateHash
        #define SHA2GenerateIntermediateHash    ROM_SHA2GenerateIntermediateHash
    #endif
    #ifdef ROM_SHA2GenerateFinalHash
        #undef  SHA2GenerateFinalHash
        #define SHA2GenerateFinalHash           ROM_SHA2GenerateFinalHash
    #endif
    #ifdef ROM_SHA2GenerateHash
        #undef  SHA2GenerateHash
        #define SHA2GenerateHash                ROM_SHA2GenerateHash
    #endif
#endif

//*****************************************************************************
//
// Mark the end of the C bindings section for C++ compilers.
//
//*****************************************************************************
#ifdef __cplusplus
}
#endif

#endif  // __SHA2_H__

//*****************************************************************************
//
//! Close the Doxygen group.
//! @}
//! @}
//
//*****************************************************************************
